package com.yuriybishel.program;

public class Program {
    public static void main(String[] args) {
        /**
         * В среде разработки IntelliJ Idea создать новый maven проект с названием Comments
         * Проверить, чтобы структура проекта была следующая: com.вашНик.program.Program. Если нет, то создать
         * Проверить, есть ли в классе запускающий метод main. Если нет, то создать
         * Документируемым комментарием в методе main показать данный текст задания
         * Выполнить вывод на экран пяти различных сообщений, проверить программу
         * Закомментировать первую команду вывода строковым комментарием
         * Закомментировать вторую и третью строки блоковым комментарием
         * Выполнить запуск программы
         * Используя горячие клавиши из лекций, произвести быстрое дублирование строки, удаление строки,
         * запуск программы, изменение позиции строк
         */
        // System.out.println("Первое сообщение");
        /*System.out.println("Второе сообщение");
        System.out.println("Третье сообщение");*/
        System.out.println("Четвертое сообщение");
        System.out.println("Пятое сообщение");
    }

}